-and
chưa có view pass
thông báo " sai thông tin đăng nhập" xuất hiện sai khi đã có thông báo kiểm tra lại đường truyền thì không xuất hiện tb nào khác.
login thành công - xuất hiện thông báo lỗi 404.
Thêm tài khoản - không có màn hình xuất hiện
Bố cục nội dung các text label - form login chưa giống thiết kế
Lỗi thông báo 400 khi login sai pass.
Lỗi không xuất hiện thông báo hs đang xếp lớp với học sinh 011611141
---
quên mk - no internet - no server- sau khi hiển thị thông báo sẽ trở về form nhập bình thường ko cần thông báo kết quả "không tìm thấy kết quả nào".
quên mk - chức năng search sẽ reset nếu click lại lần thứ 1+
quên mk - 010118579 : học sinh chỉ tồn tại EContactBookPhoneNumber : lỗi hiển thị output
quên mk - 011725675 : học sinh tồn tại sdt xác thực: lỗi hiển thị output
quên mk - 011725671 : lỗi output , hiển thị pop up thông báo với nội dung là nội dung api trả về
quên mk - title nhập tại fbkit đang hiển thị là đăng nhập
quên mk - thông báo số điện thoại không hợp lệ phải hiển thị là nội dung của api trả về.
quên mk - thông báo nhập đúng sdt xác thực không điều hướng về màn hình đặt lại mật khẩu
---
quên tk - giao diện thiếu nội dung " số điện thoại là số được xác thực trên Pino...tài khoản".
quên tk - ngày sinh chưa check phải nhỏ hơn ngày hiện tại
quên tk - chọn trường : pop up chọn trường sai title, chưa có action close, fiter search chưa có "tìm tường". Chưa hiển thị data trường cho người dùng chọn.
quên tk - số điện thoại:  bể ui, chưa cài đặt chỉ nhập là bàn phím số
quên tk - thông tin (Bùi cao Anh, 28/04/2003 0374716415, trường thcs - thpt nhật cường test): chức năng search không hoạt động
---
Bảng điểm - lỗi ui khi có extent tất cả các môn
---
Đa tài khoản - lỗi không hiển thị đa tài khoản tại home được
---
profile login - format ngày sinh dd/mm/yyyy
profile login - lỗi hiển thị vùi lòng xác thực tài khoản ( đối với học sinh đã được xác thực sẽ hiển thị "Đã xác thực tài khoản (3474712...)", ngược lại sẽ hiển thị "Vui lòng xác thực tài khoản").
profile login - xác thực tài khoản không hoạt động

---
Góp ý - nội dung vs tiêu đề phải tồn tại ít nhất 1 ký tự (a-z, A-Z, 0-9) loại trừ tất cả là phím space, phần nhập nội dung cho phép người dùng xuống dòng, đính kèm tập tin không thành công, view các tập tin đính kèm, xóa các tập tin đính kèm. 
---
Thời khóa biểu menu:
	chưa focus vào thời gian hiện tại,
	chưa map data api thời khóa biểu lên
---
Điểm danh
	map trạng thái điểm danh sai (nghỉ học không phép ?? Vắng có phép)==> map theo value PupilAttendanceStatusName
	Chưa gắn load more and reload.
---
Thiết lặp năm học
	chọn năm học khác chưa gọi api.
---
Đánh giá năng lực phẩm chất
	không load được data
	không chọn được các kỳ trong năm
	không có reload

